Ran Plan for dir: `.` workspace: `default`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_container_cluster.knative_cluster must be replaced
-/+ resource "google_container_cluster" "knative_cluster" {
      ~ cluster_ipv4_cidr           = "10.32.0.0/14" -> (known after apply)
      + datapath_provider           = (known after apply)
      + default_max_pods_per_node   = (known after apply)
      - enable_autopilot            = false -> null
      ~ enable_intranode_visibility = false -> (known after apply)
      - enable_tpu                  = false -> null
      ~ endpoint                    = "35.237.31.120" -> (known after apply)
      ~ id                          = "projects/serverless-415915/locations/us-east1-b/clusters/knative-cluster" -> (known after apply)
      ~ label_fingerprint           = "a9dc16a7" -> (known after apply)
      ~ master_version              = "1.29.0-gke.1381000" -> (known after apply)
        name                        = "knative-cluster"
      ~ network                     = "projects/serverless-415915/global/networks/default" -> "default"
      ~ networking_mode             = "ROUTES" -> (known after apply)
      ~ node_locations              = [] -> (known after apply)
      ~ node_version                = "1.29.0-gke.1381000" -> (known after apply)
      + operation                   = (known after apply)
      + private_ipv6_google_access  = (known after apply)
      ~ project                     = "serverless-415915" -> (known after apply)
      - resource_labels             = {} -> null
      ~ self_link                   = "https://container.googleapis.com/v1/projects/serverless-415915/zones/us-east1-b/clusters/knative-cluster" -> (known after apply)
      ~ services_ipv4_cidr          = "10.35.240.0/20" -> (known after apply)
      ~ subnetwork                  = "projects/serverless-415915/regions/us-east1/subnetworks/default" -> "default"
      + tpu_ipv4_cidr_block         = (known after apply)
        # (11 unchanged attributes hidden)

      ~ addons_config {
          - gce_persistent_disk_csi_driver_config {
              - enabled = true -> null
            }
          - network_policy_config {
              - disabled = true -> null
            }

            # (1 unchanged block hidden)
        }

      - binary_authorization {
          - enabled = false -> null
        }

      - cluster_autoscaling {
          - enabled = false -> null
        }

      - database_encryption {
          - state = "DECRYPTED" -> null
        }

      - default_snat_status {
          - disabled = false -> null
        }

      - logging_config {
          - enable_components = [] -> null
        }

      - master_auth {
          - cluster_ca_certificate = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUVMRENDQXBTZ0F3SUJBZ0lRVU8xRjFHZm14WUxqcUg4Z1g5RytMVEFOQmdrcWhraUc5dzBCQVFzRkFEQXYKTVMwd0t3WURWUVFERXlSak5EazBOVGd4TnkwMlpXTmpMVFExWkRndFlqRmhNeTAxT0RSbVpEUXpOVFkyT1dJdwpJQmNOTWpRd016QXhNVFl5TlRFMVdoZ1BNakExTkRBeU1qSXhOekkxTVRWYU1DOHhMVEFyQmdOVkJBTVRKR00wCk9UUTFPREUzTFRabFkyTXRORFZrT0MxaU1XRXpMVFU0Tkdaa05ETTFOalk1WWpDQ0FhSXdEUVlKS29aSWh2Y04KQVFFQkJRQURnZ0dQQURDQ0FZb0NnZ0dCQUx4aVVWMzBMQ2x5QUN1NVR1UkZMWGs1RmEwTjlpRWVXcE0yR3lxYgpWL3oxWTQyaHFOSjlZbU5SUVFLd2NnVytmMkdlc3BGZC94NXBvWGl2TlJ0dkFMb3hSY3laVVZxWEFjbjVJOVZNCjRLUlhyR1QySXVIZDZyZGRoLzdGeGk1UnBEOWttVkZ4cFMvVm9QZlJHNFFxUzM3RTB6VlNjNGVtRHloYTJoeVEKcVJiM3dpTHloWVQ4ZC9KS0w4LzlaN3FPVm5zZG9xc21BeTl2enFheEdMTjRSaE9IcFI0Wm55MDZZUXJrUmZUTQpJb3JkQU01SHZXNHNrT0M0UEw4elQwbCszUVIrdU5MVFVRYzNsVFZNRG5jVTcrMEZpZTNGSTFrNzM3VkZkSmJDCnJrL1V3WExHbWxHb0FhWklFTWNMaDVyeE5oVDZ2UVJOMVRIQllqVlBORzQ5RFNocWloNk9YdU9KcFBCcWZVVFEKVC9HR3o2RXQ2MEMzQktRalY5Wm9PcVJwelhmYjZENFR5OVIza29wbm5ib3pWRzg3N0sweFhxNHhjTWRoT0hUego3ZzdkdGNTQ1F6NGtFbVQyc1NybWhjUSs2NEh4M05wK0hOZWhORE4rWC8ycTlOM0RVVWlUZEo5TW1SbEwyTXFCCittNzhpT2FNYVRaYkJKODY4RmppTUE3VDBRSURBUUFCbzBJd1FEQU9CZ05WSFE4QkFmOEVCQU1DQWdRd0R3WUQKVlIwVEFRSC9CQVV3QXdFQi96QWRCZ05WSFE0RUZnUVVWSi94N2s0ejh2a3UrK0hSaStubXFkSXkvckV3RFFZSgpLb1pJaHZjTkFRRUxCUUFEZ2dHQkFCc1pjZkNEaVJJVEhwS2lUeEljbVBpd256NlI5MXJ1c0twUU5rSnJZbEkrCnR5UnhFdTNJeFB6cXNqV2lBdjZmWjhjNDdBNHFod2FFY3FxUGpZaTdXNllCbUVONWNWWnA2N1BEMDVzNXRGcnUKTmltc1lWVXdKZEJkZFZIc2hzM0s4Q2Z5YjVhQURRdzN5ZXpmRFI0UXpiOGZTNkZ5aFFJV3M0d0N6dTU2OGJCaQovRUozK3N5di95bzNJd201SU5EV1lQQ0MvNkZXU0d6S1RpY2xISTlyRjdLNVBHNDlsMVVNbk9HZjdjdEtYcmNWCjFRUDhaSjVHNFRmcHI2cFVkZlVoU0hBQjY1MitYVnpjRy9tTFY5U2F6RG01SEo3a3cvcXI2M1lhU1dYNm9WdDUKTm1BQ1duV1k4L0RuenFzZ0ZGSDdHbk9OZE9pbGQvZzVwUHBpV0RxNkg4TlJHWEpNejM1V2NkWTVoZzJ1TWlzQQoyQTNBYnhRRUlYY2RIdHlQZDNOUGVyZjFNQUt2QkQ3Sjk5TlFveVRnWTRPdVpSN2kzZkRwcWlwTXR5Mm1HUlo5Clg4SzZhV3ZwK1RjS01GSlBITkFXUVc1S2pFRS9qak9YTnVldnRSTXRpellKODM2aGJUZ1Q0TVRZWkNtOWhhZFIKSEh0dkFVdHdhODU4czU4V2tSK0VvQT09Ci0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0K" -> null

          - client_certificate_config {
              - issue_client_certificate = false -> null
            }
        }

      - monitoring_config {
          - enable_components = [] -> null

          - managed_prometheus {
              - enabled = true -> null
            }
        }

      - network_policy {
          - enabled  = false -> null
          - provider = "PROVIDER_UNSPECIFIED" -> null
        }

      ~ node_config {
          ~ disk_size_gb      = 100 -> (known after apply)
          ~ disk_type         = "pd-balanced" -> (known after apply)
          ~ guest_accelerator = [] -> (known after apply)
          ~ image_type        = "COS_CONTAINERD" -> (known after apply)
          ~ labels            = {} -> (known after apply)
          ~ local_ssd_count   = 0 -> (known after apply)
          ~ machine_type      = "e2-small" -> "e2-micro" # forces replacement
          ~ metadata          = {
              - "disable-legacy-endpoints" = "true"
            } -> (known after apply)
          + min_cpu_platform  = (known after apply)
          - resource_labels   = {} -> null
          ~ service_account   = "default" -> (known after apply)
          - tags              = [] -> null
          ~ taint             = [] -> (known after apply)
            # (4 unchanged attributes hidden)

          - shielded_instance_config {
              - enable_integrity_monitoring = true -> null
              - enable_secure_boot          = false -> null
            }
        }

      - node_pool {
          - initial_node_count          = 1 -> null
          - instance_group_urls         = [
              - "https://www.googleapis.com/compute/v1/projects/serverless-415915/zones/us-east1-b/instanceGroupManagers/gke-knative-cluster-primary-node-pool-b817265a-grp",
            ] -> null
          - managed_instance_group_urls = [
              - "https://www.googleapis.com/compute/v1/projects/serverless-415915/zones/us-east1-b/instanceGroups/gke-knative-cluster-primary-node-pool-b817265a-grp",
            ] -> null
          - max_pods_per_node           = 0 -> null
          - name                        = "primary-node-pool" -> null
          - node_count                  = 3 -> null
          - node_locations              = [
              - "us-east1-b",
            ] -> null
          - version                     = "1.29.0-gke.1381000" -> null

          - autoscaling {
              - location_policy      = "ANY" -> null
              - max_node_count       = 6 -> null
              - min_node_count       = 1 -> null
              - total_max_node_count = 0 -> null
              - total_min_node_count = 0 -> null
            }

          - management {
              - auto_repair  = true -> null
              - auto_upgrade = true -> null
            }

          - network_config {
              - create_pod_range     = false -> null
              - enable_private_nodes = false -> null
            }

          - node_config {
              - disk_size_gb      = 100 -> null
              - disk_type         = "pd-balanced" -> null
              - guest_accelerator = [] -> null
              - image_type        = "COS_CONTAINERD" -> null
              - labels            = {} -> null
              - local_ssd_count   = 0 -> null
              - logging_variant   = "DEFAULT" -> null
              - machine_type      = "e2-small" -> null
              - metadata          = {
                  - "disable-legacy-endpoints" = "true"
                } -> null
              - oauth_scopes      = [
                  - "https://www.googleapis.com/auth/cloud-platform",
                ] -> null
              - preemptible       = false -> null
              - resource_labels   = {} -> null
              - service_account   = "default" -> null
              - spot              = true -> null
              - tags              = [] -> null
              - taint             = [] -> null

              - shielded_instance_config {
                  - enable_integrity_monitoring = true -> null
                  - enable_secure_boot          = false -> null
                }
            }

          - upgrade_settings {
              - max_surge       = 1 -> null
              - max_unavailable = 0 -> null
              - strategy        = "SURGE" -> null
            }
        }

      - node_pool_defaults {
          - node_config_defaults {
              - logging_variant = "DEFAULT" -> null
            }
        }

      - notification_config {
          - pubsub {
              - enabled = false -> null
            }
        }

      - private_cluster_config {
          - enable_private_endpoint = false -> null
          - enable_private_nodes    = false -> null
          - private_endpoint        = "10.142.0.2" -> null
          - public_endpoint         = "35.237.31.120" -> null

          - master_global_access_config {
              - enabled = false -> null
            }
        }

      - release_channel {
          - channel = "REGULAR" -> null
        }

      - service_external_ips_config {
          - enabled = false -> null
        }
    }

  # google_container_node_pool.primary_nodes must be replaced
-/+ resource "google_container_node_pool" "primary_nodes" {
      ~ id                          = "projects/serverless-415915/locations/us-east1-b/clusters/knative-cluster/nodePools/primary-node-pool" -> (known after apply)
      ~ initial_node_count          = 1 -> (known after apply)
      ~ instance_group_urls         = [
          - "https://www.googleapis.com/compute/v1/projects/serverless-415915/zones/us-east1-b/instanceGroupManagers/gke-knative-cluster-primary-node-pool-b817265a-grp",
        ] -> (known after apply)
      ~ managed_instance_group_urls = [
          - "https://www.googleapis.com/compute/v1/projects/serverless-415915/zones/us-east1-b/instanceGroups/gke-knative-cluster-primary-node-pool-b817265a-grp",
        ] -> (known after apply)
      + max_pods_per_node           = (known after apply)
        name                        = "primary-node-pool"
      + name_prefix                 = (known after apply)
      ~ node_count                  = 3 -> 1
      ~ node_locations              = [
          - "us-east1-b",
        ] -> (known after apply)
      + operation                   = (known after apply)
      ~ project                     = "serverless-415915" -> (known after apply)
      ~ version                     = "1.29.0-gke.1381000" -> (known after apply)
        # (2 unchanged attributes hidden)

      ~ autoscaling {
          ~ location_policy      = "ANY" -> (known after apply)
          - total_max_node_count = 0 -> null
          - total_min_node_count = 0 -> null
            # (2 unchanged attributes hidden)
        }

      - management {
          - auto_repair  = true -> null
          - auto_upgrade = true -> null
        }

      - network_config {
          - create_pod_range     = false -> null
          - enable_private_nodes = false -> null
        }

      ~ node_config {
          ~ disk_size_gb      = 100 -> (known after apply)
          ~ disk_type         = "pd-balanced" -> (known after apply)
          ~ guest_accelerator = [] -> (known after apply)
          ~ image_type        = "COS_CONTAINERD" -> (known after apply)
          ~ labels            = {} -> (known after apply)
          ~ local_ssd_count   = 0 -> (known after apply)
          ~ machine_type      = "e2-small" -> "e2-micro" # forces replacement
          ~ metadata          = {
              - "disable-legacy-endpoints" = "true"
            } -> (known after apply)
          + min_cpu_platform  = (known after apply)
          - resource_labels   = {} -> null
          ~ service_account   = "default" -> (known after apply)
          - tags              = [] -> null
          ~ taint             = [] -> (known after apply)
            # (4 unchanged attributes hidden)

          - shielded_instance_config {
              - enable_integrity_monitoring = true -> null
              - enable_secure_boot          = false -> null
            }
        }

      - upgrade_settings {
          - max_surge       = 1 -> null
          - max_unavailable = 0 -> null
          - strategy        = "SURGE" -> null
        }
    }

Plan: 2 to add, 0 to change, 2 to destroy.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d .`
* :put_litter_in_its_place: To **delete** this plan click [here](https://7edd93f2563f.ngrok.app/lock?id=peridotml%252Fserverless%252F.%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d .`
</details>
Plan: 2 to add, 0 to change, 2 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To **delete** all plans and locks for the PR, comment:
    * `atlantis unlock`